UNF_KlK.КИТ_ДОК/src/Documents/УкладкаВШтабель/УкладкаВШтабель.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>УкладкаВШтабель</name>
  <registerRecords>AccumulationRegister.ДвижениеПоПроизводству</registerRecords>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.ПодразделенияОрганизаций</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <comment>Любая дополнительная информация</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтчетПроизводстваУНФ</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Состав</name>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>Порода</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Сорт</name>
      <type>
        <types>CatalogRef.ЗначенияСвойствОбъектов</types>
      </type>
    </attributes>
    <attributes>
      <name>Длина</name>
      <type>
        <types>CatalogRef.Длины</types>
      </type>
    </attributes>
    <attributes>
      <name>Ширина</name>
      <type>
        <types>CatalogRef.Ширины</types>
      </type>
    </attributes>
    <attributes>
      <name>Толщина</name>
      <type>
        <types>CatalogRef.Толщины</types>
      </type>
    </attributes>
    <attributes>
      <name>КоличествоДосок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>10</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъемДосок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СкладПолучатель</name>
      <type>
        <types>CatalogRef.СтруктурныеЕдиницы</types>
      </type>
    </attributes>
    <attributes>
      <name>Несертифицированный</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

UNF_KlK.КИТ_ДОК/src/Documents/УкладкаВШтабель/ManagerModule.bsl
#Область ИнтерфейсПечати

Функция ОписатьПравилаЗаполненияПодписей() Экспорт
	
	РеквизитыОбъекта = Новый Соответствие;
	
	РеквизитыОбъекта.Вставить("ПодписьРуководителя", "Организация.ПодписьРуководителя");
	РеквизитыОбъекта.Вставить("ПодписьКладовщика", "СтруктурнаяЕдиница.ПодписьМОЛ");
	РеквизитыОбъекта.Вставить("Комиссия", "ЭтоКомиссия");
	
	Возврат РеквизитыОбъекта;
	
КонецФункции

// Функция формирует печатную форму документа по указанному макету.
//
// Параметры:
//	ТабличныйДокумент - ТабличныйДокумент в который будет выводится печатная
//				   форма.
//  ИмяМакета    - Строка, имя макета печатной формы.
//
Функция ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, ИмяМакета)
	Перем Ошибки;
	
	ПараметрыНоменклатуры = Новый Структура;
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.КлючПараметровПечати = "ПараметрыПечати_ОтчетПроизводстваЗаСменуОкорка";
	
	ПервыйДокумент = Истина;
	
	Для Каждого ТекущийДокумент Из МассивОбъектов Цикл
	
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		Если ИмяМакета = "РеестрВыборотки" Тогда
			ПечатьРеестр(ТабличныйДокумент, ТекущийДокумент);
					
			
			
		КонецЕсли;
		
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ТекущийДокумент);
		
	КонецЦикла;
	
	ТабличныйДокумент.АвтоМасштаб = Истина;
	
	Возврат ТабличныйДокумент;
	
КонецФункции // ПечатнаяФорма()

// Сформировать печатные формы объектов
//
// ВХОДЯЩИЕ:
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//
// ИСХОДЯЩИЕ:
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	
	
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "РеестрВыборотки") Тогда
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(КоллекцияПечатныхФорм, "РеестрВыборотки", НСтр("ru = 'Реестр выборотки'"), ПечатнаяФорма(МассивОбъектов, ОбъектыПечати, "РеестрВыборотки"));
		
	КонецЕсли;
	
	
	// параметры отправки печатных форм по электронной почте
	ЭлектроннаяПочтаУНФ.ЗаполнитьПараметрыОтправки(ПараметрыВывода.ПараметрыОтправки, МассивОбъектов,
		КоллекцияПечатныхФорм);
	
КонецПроцедуры

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати.
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	КомандаПечати.Идентификатор = "РеестрВыборотки";
	КомандаПечати.Представление = НСтр("ru = 'Реестр выборотки'");
	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
	КомандаПечати.Порядок = 1;
//	
//	КомандаПечати = КомандыПечати.Добавить();
//	КомандаПечати.Идентификатор = "ТОРГ4";
//	КомандаПечати.Представление = НСтр("ru = 'ТОРГ4 (Акт о приемке товара)'");
//	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
//	КомандаПечати.Порядок = 4;
//	
//	КомандаПечати = КомандыПечати.Добавить();
//	КомандаПечати.Идентификатор = "ПриходныйОрдер";
//	КомандаПечати.Представление = НСтр("ru = 'Приходный ордер'");
//	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
//	КомандаПечати.Порядок = 7;
//	
//	КомандаПечати = КомандыПечати.Добавить();
//	КомандаПечати.Идентификатор = "БланкТоварногоНаполнения";
//	КомандаПечати.Представление = Обработки.ПечатьБланкТоварногоНаполнения.ПредставлениеПФ();
//	КомандаПечати.ПроверкаПроведенияПередПечатью = Истина;
//	КомандаПечати.Порядок = 10;
	
КонецПроцедуры

#КонецОбласти

Процедура ПечатьРеестр(ТабДок, Ссылка) Экспорт
	
	Макет = Документы.УкладкаВШтабель.ПолучитьМакет("ПечатьРеестр");
	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ
		|	УкладкаВШтабель.Номер,
		|	УкладкаВШтабель.Дата,
		|	УкладкаВШтабель.Организация,
		|	УкладкаВШтабель.Подразделение,
		|	УкладкаВШтабель.Автор,
		|	УкладкаВШтабель.Состав.(
		|		НомерСтроки,
		|		Номенклатура,
		|		Порода,
		|		Сорт,
		|		Длина,
		|		Ширина,
		|		Толщина,
		|		КоличествоДосок,
		|		ОбъемДосок,
		|		СкладПолучатель)
		|ИЗ
		|	Документ.УкладкаВШтабель КАК УкладкаВШтабель
		|ГДЕ
		|	УкладкаВШтабель.Ссылка В (&Ссылка)";
	Запрос.Параметры.Вставить("Ссылка", Ссылка);
	Выборка = Запрос.Выполнить().Выбрать();

	ОбластьЗаголовок = Макет.ПолучитьОбласть("Заголовок");
	Шапка = Макет.ПолучитьОбласть("Шапка");
	ОбластьСырьеШапка = Макет.ПолучитьОбласть("СырьеШапка");
	ОбластьСырье = Макет.ПолучитьОбласть("Сырье");
	ОбластьСоставШапка = Макет.ПолучитьОбласть("СоставШапка");
	ОбластьСостав = Макет.ПолучитьОбласть("Состав");
	
	
	Пока Выборка.Следующий() Цикл
		

		ТабДок.Вывести(ОбластьЗаголовок);
		
		Шапка.Параметры.Заполнить(Выборка);
		ТабДок.Вывести(Шапка, Выборка.Уровень());
			
		ТабДок.Вывести(ОбластьСоставШапка);
		ВыборкаСостав = Выборка.Состав.Выбрать();
		Пока ВыборкаСостав.Следующий() Цикл
			ОбластьСостав.Параметры.Заполнить(ВыборкаСостав);
			ТабДок.Вывести(ОбластьСостав, ВыборкаСостав.Уровень());
		КонецЦикла;
		
		ВставлятьРазделительСтраниц = Истина;
	КонецЦикла;
	
КонецПроцедуры
